package ch06.check1.Bank;

//import java.util.Scanner;

public class BankSudo {
	public static void main(String[] args) {
		
//		객체타입 Account = 객체타입 [100];
		
//		분석
//		계좌 = Account int[100]
//		스캐너
//
//		메뉴 1. 계좌 생성 -> 할 때마다 객체 생성 
//		계좌 번호 입력 String
//		계좌 주 입력 String
//		초기 입금액 입력 int
//		유효성 검사 후 계좌가 생성 되었습니다. 라고 하기 
//		생성 된 계좌는 배열에 넣기
//		근데 왜 배열로 ...하지? 다차원 배열로 하면 안되나....만들 때 마다 객체 생성해서 관리해서 그런가?
//		그럼 어떻게 접근하지...계좌 번호로 접근하네...일단 ㅇㅋ 유효성 검사 빡셀듯...
//
//
//		메뉴 2. 계좌 목록
//		생성한 계좌 목록 보여주면 되는데.
//		생성한 객체를 for문으로 불러올 수 있다고...? 객체 자체를 배열에 넣어서 접근
//		객체 생성할 때 마다 카운트 할 변수 만들기
//
//		메뉴 3. 예금
//		계좌번호 입력하면 입금할 금액 받아서 넣기
//		유효성 검사( 음수의 값이나 숫자가 아닌 값이 들어오거나 아무것도 안 들어오면 다시 입력하라고 하기 )
//
//		메뉴 4. 출금
//		계좌번호 입력하면 출금할 금액 받아서 넣기
//		유효성 검사( 음수의 값이나 숫자가 아닌 값이 들어오거나 아무것도 안 들어오면 다시 입력하라고 하기, 잔고보다 큰 금액은 안 됨 )
//
//		메뉴 5. 종료


//		예금
//
//		계좌번호를 받아서 -> 계좌번호가 있는지 확인하고 -> 있으면 예금액을 받아서 balance 필드에 더해, 예금액의 유효성 검사도 해야해
//							  -> 없으면 계좌번호가 없다고 하고 다시 받아 3번 if 문 자체가 while문 안에 들어가야 할 듯
//
//		유효성 검사 
//
//		1. 계좌생성
//		빈값들어갔다고 오류 남 -> String부분은 빈값넣어도 오류는 안 나는데 int 값 받는 부분에 빈 값 넣으면 오류 남(스트링을 넣어도 남)
//		(이 부분 getter setter로 수정 할 수 있을 것 같음
//		이미 생성 된 계좌 번호는 또 생성 할 수 없어야 함 
//
//		2. 계좌 목록
//		이건 뭐 없을 듯
//
//		3. 예금 
//		계좌 번호 유효성 검사는 함, 예금액 음수의 값 안되고 0초과 숫자여야 함
//
//		4. 출금
//		출금액이 잔고보다 클수 없음 음수의 값 안되고 0초과 숫자여야 함







		
		
		
		
		
		
		
	}
}
